src/CF/InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CF/InformationRegisters/НастройкиПользователей/Forms/ФормаСписка/Ext/Form/Module.bsl
//sza140509-0122  
//sza131129-2329  
&НаКлиенте
Процедура ГруппыНастроекПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьОтборПоИерархииОбработчикОжидания", 0.2, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗначениямиОбщихНастроек(Команда)
	
	ЗаполнитьЗначениямиОбщихНастроекНаСервере(ТекущийПользователь);
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЗначениямиОбщихНастроекНаСервере(ТекущийПользователь)
	
	ПредопределеннаяНастройка = ПланыВидовХарактеристик.НастройкиПользователей.Выбрать();
	Пока ПредопределеннаяНастройка.Следующий() Цикл
		
		Если НЕ ПредопределеннаяНастройка.ЭтоГруппа Тогда
			НастройкаИмя 	= планывидовхарактеристик.НастройкиПользователей.ПолучитьИмяПредопределенного(ПредопределеннаяНастройка.Ссылка);
			Настройка 		= ПланыВидовХарактеристик.НастройкиПользователей[НастройкаИмя];
			
			РСНЗ = регистрысведений.НастройкиПользователей.СоздатьНаборЗаписей();
			
			РСНЗ.Отбор.Пользователь.Установить(ТекущийПользователь);
			РСНЗ.Отбор.Настройка.Установить(Настройка);
			
			Добавлять = ЛОЖЬ;
			РСНЗ.Прочитать();
			Если РСНЗ.Количество() = 0 тогда
				Добавлять = ИСТИНА;
			Иначе
				Если РСНЗ[0].ЗначениеНастройки = Неопределено 
					ИЛИ НЕ ЗначениеЗаполнено(РСНЗ[0].ЗначениеНастройки) Тогда
					
					Добавлять = ИСТИНА;
				КонецЕсли;
			КонецЕсли;
			
			Если Добавлять Тогда	
				РСНЗ.Очистить();
				
				НоваяЗапись = РСНЗ.Добавить();
				НоваяЗапись.Пользователь = ТекущийПользователь;
				НоваяЗапись.Настройка 	 = Настройка;						
				НоваяЗапись.ЗначениеНастройки = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты(НастройкаИмя, ИСТИНА);
				
				РСНЗ.Записать(ИСТИНА);          	
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ТекущиеДанные.ДатаУстановки = ТекущаяДата();
	ТекущиеДанные.Пользователь 	= ТекущийПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	ТекущиеДанные.Пользователь = ТекущийПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидОкна()
	
	Элементы.ГруппаГоризонт.Видимость 		= НЕ ВидОкнаВсеНастройки;
	Элементы.ГруппаВсеНастройки.Видимость 	= ВидОкнаВсеНастройки;
	
Конецпроцедуры

&НаСервере
Процедура ОбновитьПараметрыПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПользователей.Ссылка
	|ИЗ
	|	ПланВидовХарактеристик.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.ЭтоГруппа = ЛОЖЬ
	|	И НастройкиПользователей.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		РСНЗ = регистрысведений.НастройкиПользователей.СоздатьНаборЗаписей();
		
		РСНЗ.Отбор.Пользователь.Установить(ТекущийПользователь);
		РСНЗ.Отбор.Настройка.Установить(ВыборкаДетальныеЗаписи.Ссылка);
		
		РСНЗ.Прочитать();
		Если РСНЗ.Количество() = 0 тогда
			
			НоваяЗапись = РСНЗ.Добавить();
			НоваяЗапись.Пользователь 	= ТекущийПользователь;
			НоваяЗапись.Настройка 		= ВыборкаДетальныеЗаписи.Ссылка;			
			
			РСНЗ.Записать(ИСТИНА);          	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ОбновитьВидОкна();
	Если НЕ ВидОкнаВсеНастройки Тогда
		УстановитьОтборПоИерархииОбработчикОжидания();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Отказ Тогда
		ТекущийПользователь = параметрысеанса.ТекущийПользователь;
		Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);
		СписокВсеНастройки.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);
		
		ПлатнаяВерсия = ОбщийМодульПовтор.ПлатнаяВерсия();
		Если НЕ платнаяверсия Тогда
			
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НастройкаКод");
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.НеСодержит;
			ЭлементОтбора.ПравоеЗначение 	= "NF";
			ЭлементОтбора.Использование 	= ИСТИНА;
			Элементы.Список.Обновить();
			
			ЭлементОтбора = СписокВсеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("НастройкаКод");
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.НеСодержит;
			ЭлементОтбора.ПравоеЗначение 	= "NF";
			ЭлементОтбора.Использование 	= ИСТИНА;
			Элементы.Список.Обновить();
			
		КонецЕсли;
		
		ОбновитьПараметрыПользователя();
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);	
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(СписокВсеНастройки);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьЛичныеНастройки(Команда)
	
	СброситьЛичныеНастройкиНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Процедура СброситьЛичныеНастройкиНаСервере()
	
	РСНЗ = регистрысведений.НастройкиПользователей.СоздатьНаборЗаписей();
	РСНЗ.Отбор.Пользователь.Установить(ТекущийПользователь);
	РСНЗ.Прочитать();
	РСНЗ.Очистить();
	РСНЗ.Записать(ИСТИНА);
	
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьПараметрыПользователя();
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьВидОкна(Команда)
	
	ВидОкнаВсеНастройки = НЕ ВидОкнаВсеНастройки;
	ОбновитьВидОкна();	
	Если НЕ ВидОкнаВсеНастройки Тогда
		УстановитьОтборПоИерархииОбработчикОжидания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоИерархииОбработчикОжидания()
	
	СменуПроизвелилева = ИСТИНА;
	ТекущиеДанныеНавигации = Элементы.ГруппыНастроек.ТекущиеДанные;
	
	ЗначениеОтбора = ?(ТекущиеДанныеНавигации <> Неопределено, ТекущиеДанныеНавигации.Ссылка, ПредопределенноеЗначение("ПланВидовХарактеристик.НастройкиПользователей.ПустаяСсылка"));
	ОбщийМодульКлиент.УстановитьЭлементОтбора(
	Список.Отбор,
	"Настройка.Родитель",
	ЗначениеОтбора,
	ВидСравненияКомпоновкиДанных.Равно,
	,
	ИСТИНА
	);
	
КонецПроцедуры
